import React from "react";
import Project1Img from "../static/img/project/project1.png";
import Project2Img from "../static/img/project/project2.png";
import Project3Img from "../static/img/project/project3.png";

const CI_ANDROID = (
  <svg role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
    <title>Android</title>
    <path d="M17.523 15.3414c-.5511 0-.9993-.4486-.9993-.9997s.4483-.9993.9993-.9993c.5511 0 .9993.4483.9993.9993.0001.5511-.4482.9997-.9993.9997m-11.046 0c-.5511 0-.9993-.4486-.9993-.9997s.4482-.9993.9993-.9993c.5511 0 .9993.4483.9993.9993 0 .5511-.4483.9997-.9993.9997m11.4045-6.02l1.9973-3.4592a.416.416 0 00-.1521-.5676.416.416 0 00-.5676.1521l-2.0223 3.503C15.5902 8.2439 13.8533 7.8508 12 7.8508s-3.5902.3931-5.1367 1.0989L4.841 5.4467a.4161.4161 0 00-.5677-.1521.4157.4157 0 00-.1521.5676l1.9973 3.4592C2.6889 11.1867.3432 14.6589 0 18.761h24c-.3435-4.1021-2.6892-7.5743-6.1185-9.4396" />
  </svg>
);

const CI_KOTLIN = (
  <svg role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
    <title>Kotlin</title>
    <path d="M24 24H0V0h24L12 12Z" />
  </svg>
);

const CI_REACT = (
  <svg role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
    <title>React</title>
    <path d="M14.23 12.004a2.236 2.236 0 0 1-2.235 2.236 2.236 2.236 0 0 1-2.236-2.236 2.236 2.236 0 0 1 2.235-2.236 2.236 2.236 0 0 1 2.236 2.236zm2.648-10.69c-1.346 0-3.107.96-4.888 2.622-1.78-1.653-3.542-2.602-4.887-2.602-.41 0-.783.093-1.106.278-1.375.793-1.683 3.264-.973 6.365C1.98 8.917 0 10.42 0 12.004c0 1.59 1.99 3.097 5.043 4.03-.704 3.113-.39 5.588.988 6.38.32.187.69.275 1.102.275 1.345 0 3.107-.96 4.888-2.624 1.78 1.654 3.542 2.603 4.887 2.603.41 0 .783-.09 1.106-.275 1.374-.792 1.683-3.263.973-6.365C22.02 15.096 24 13.59 24 12.004c0-1.59-1.99-3.097-5.043-4.032.704-3.11.39-5.587-.988-6.38-.318-.184-.688-.277-1.092-.278zm-.005 1.09v.006c.225 0 .406.044.558.127.666.382.955 1.835.73 3.704-.054.46-.142.945-.25 1.44-.96-.236-2.006-.417-3.107-.534-.66-.905-1.345-1.727-2.035-2.447 1.592-1.48 3.087-2.292 4.105-2.295zm-9.77.02c1.012 0 2.514.808 4.11 2.28-.686.72-1.37 1.537-2.02 2.442-1.107.117-2.154.298-3.113.538-.112-.49-.195-.964-.254-1.42-.23-1.868.054-3.32.714-3.707.19-.09.4-.127.563-.132zm4.882 3.05c.455.468.91.992 1.36 1.564-.44-.02-.89-.034-1.345-.034-.46 0-.915.01-1.36.034.44-.572.895-1.096 1.345-1.565zM12 8.1c.74 0 1.477.034 2.202.093.406.582.802 1.203 1.183 1.86.372.64.71 1.29 1.018 1.946-.308.655-.646 1.31-1.013 1.95-.38.66-.773 1.288-1.18 1.87-.728.063-1.466.098-2.21.098-.74 0-1.477-.035-2.202-.093-.406-.582-.802-1.204-1.183-1.86-.372-.64-.71-1.29-1.018-1.946.303-.657.646-1.313 1.013-1.954.38-.66.773-1.286 1.18-1.868.728-.064 1.466-.098 2.21-.098zm-3.635.254c-.24.377-.48.763-.704 1.16-.225.39-.435.782-.635 1.174-.265-.656-.49-1.31-.676-1.947.64-.15 1.315-.283 2.015-.386zm7.26 0c.695.103 1.365.23 2.006.387-.18.632-.405 1.282-.66 1.933-.2-.39-.41-.783-.64-1.174-.225-.392-.465-.774-.705-1.146zm3.063.675c.484.15.944.317 1.375.498 1.732.74 2.852 1.708 2.852 2.476-.005.768-1.125 1.74-2.857 2.475-.42.18-.88.342-1.355.493-.28-.958-.646-1.956-1.1-2.98.45-1.017.81-2.01 1.085-2.964zm-13.395.004c.278.96.645 1.957 1.1 2.98-.45 1.017-.812 2.01-1.086 2.964-.484-.15-.944-.318-1.37-.5-1.732-.737-2.852-1.706-2.852-2.474 0-.768 1.12-1.742 2.852-2.476.42-.18.88-.342 1.356-.494zm11.678 4.28c.265.657.49 1.312.676 1.948-.64.157-1.316.29-2.016.39.24-.375.48-.762.705-1.158.225-.39.435-.788.636-1.18zm-9.945.02c.2.392.41.783.64 1.175.23.39.465.772.705 1.143-.695-.102-1.365-.23-2.006-.386.18-.63.406-1.282.66-1.933zM17.92 16.32c.112.493.2.968.254 1.423.23 1.868-.054 3.32-.714 3.708-.147.09-.338.128-.563.128-1.012 0-2.514-.807-4.11-2.28.686-.72 1.37-1.536 2.02-2.44 1.107-.118 2.154-.3 3.113-.54zm-11.83.01c.96.234 2.006.415 3.107.532.66.905 1.345 1.727 2.035 2.446-1.595 1.483-3.092 2.295-4.11 2.295-.22-.005-.406-.05-.553-.132-.666-.38-.955-1.834-.73-3.703.054-.46.142-.944.25-1.438zm4.56.64c.44.02.89.034 1.345.034.46 0 .915-.01 1.36-.034-.44.572-.895 1.095-1.345 1.565-.455-.47-.91-.993-1.36-1.565z" />
  </svg>
);

const CI_JETPACK_COMPOSE = (
  <svg role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
    <title>Jetpack Compose</title>
    <path d="M12.135.003a2.577 2.577 0 0 0-1.42.344L2.55 5.06a2.577 2.577 0 0 0-.953.967l3.957 2.17a1.765 1.765 0 0 1 .603-.588l4.951-2.86a1.761 1.761 0 0 1 1.76 0l4.951 2.86a1.753 1.753 0 0 1 .526.46l3.921-2.265a2.577 2.577 0 0 0-.816-.744L13.291.347a2.577 2.577 0 0 0-1.152-.34Zm-.145 4.912a1.36 1.36 0 0 0-.68.182L6.36 7.953a1.345 1.345 0 0 0-.454.435l1.92 1.055a1.05 1.05 0 0 1 .31-.275l3.34-1.928a1.054 1.054 0 0 1 1.051 0l3.336 1.928a1.066 1.066 0 0 1 .238.199l.018-.01-.002-.002 1.877-1.08a1.353 1.353 0 0 0-.373-.322l-4.95-2.86a1.357 1.357 0 0 0-.68-.178Zm10.432 1.149-3.92 2.26a1.757 1.757 0 0 1 .2.812v5.715c0 .627-.332 1.21-.88 1.528l-4.95 2.86a1.761 1.761 0 0 1-.64.214v4.524a2.577 2.577 0 0 0 1.059-.313l8.162-4.713a2.577 2.577 0 0 0 1.289-2.23V7.297a2.577 2.577 0 0 0-.318-1.228Zm-20.937.238a2.577 2.577 0 0 0-.227.99v9.43c0 .918.491 1.767 1.293 2.229l8.162 4.713a2.57 2.57 0 0 0 1.225.336v-4.531a1.761 1.761 0 0 1-.833-.235L6.156 16.38a1.765 1.765 0 0 1-.877-1.528V9.136a1.776 1.776 0 0 1 .131-.676Zm16.67 2.223-1.89 1.092a1.058 1.058 0 0 1 .124.46v3.856c0 .378-.2.72-.526.907l-3.336 1.93a1.04 1.04 0 0 1-.295.107v2.17c.152-.027.304-.078.44-.157l4.949-2.859a1.36 1.36 0 0 0 .68-1.18V9.136a1.36 1.36 0 0 0-.147-.607Zm-12.387.13a1.36 1.36 0 0 0-.088.481v5.715a1.36 1.36 0 0 0 .68 1.18l4.95 2.86c.194.112.412.166.627.177v-2.174a1.054 1.054 0 0 1-.46-.123L8.14 14.843a1.054 1.054 0 0 1-.532-.908v-3.853a.99.99 0 0 1 .077-.38l-.034-.013z" />
  </svg>
);

type ProjectTags =
  | "Design System"
  | "Code Style"
  | "UX Writing"
  | "Plugin"
  | "Web";

const targets = {
  android: {
    icon: CI_ANDROID,
    name: "android",
  },
  kotlin: {
    icon: CI_KOTLIN,
    name: "kotlin",
  },
  react: {
    icon: CI_REACT,
    name: "react",
  },
  jetpackCompose: {
    icon: CI_JETPACK_COMPOSE,
    name: "jetpack compose",
  },
};

type Project = {
  // 프로젝트 이름(레포지토리)
  name: string;

  // 프로젝트 아이콘
  iconImage: string;

  // 프로젝트 배경 이미지
  backgroundImage: string;

  /**
   * 메인 페이지에서는 일정 길이가 넘어가면 알아서 ... 처리가 됩니다.
   */
  description: string;

  /**
   * 오픈소스 태그입니다. 메인페이지 노출과 태그로 프로젝트 보기를 할 때 사용됩니다.
   * 디스플레이 용이 아닌 url과 같이 내부적으로 처리할 때는 "대소문자를 가리지 않고", "띄어쓰기를 -로 치환해서" 사용합니다.
   * 즉 화면에는 "Design System"으로 표시되나 url에서는 'design-system'으로 사용됩니다.
   * 만약 'design-system'으로 처리되는 태그가 여러 종류가 되버리는 경우, 정상적인 작동을 보장하지 않으니, "대소문자"와 "띄어쓰기"를 하나로 통합해주세요!
   * 이를 위해 ProjectTags 타입을 만들었습니다. 프로젝트를 추가할 때는 이 타입에 있는 문자열만 가능하니, 새로운 태그를 추가할 때는 위 타입을 먼저 수정해주세요! (본 파일 맨 상단에 있습니다)
   */
  tags: ProjectTags[];

  /**
   * 해당 오픈소스의 대상(언어, 플랫폼, 런타임 등)입니다. icon에는 React.Node나 svg 파일이 들어갈 수 있습니다.
   * 다른 아이콘을 사용할 수 있겠지만, 가장 권장하는 방법은 https://simpleicons.org/ 에서 svg를 복사한 후
   * 아래 사례처럼 사용하는 것입니다.
   * name의 경우 tooltip과 링크를 위해 있는 기능입니다.
   * 이를 위해 미리 targets 변수를 만들었습니다. targets에 해당 타깃이 있는 경우 targets.android 형태로 적으시면 됩니다.
   */
  target: {
    name: string;
    icon: React.ReactNode | string;
  }[];

  // 링크
  link: string;

  // 랜딩 페이지(/)에 표시
  showFeaturedProjects: boolean;
};

/**
 * 아래 내용을 수정하고 배포하면 프로젝트 전체에 반영됩니다. 아래 주의사항을 잘 읽어주세요!
 *
 * 1. 오브젝트의 '키'와 속성중 'name'은 반드시 동일한 값이어야 합니다.
 * 2. 메인화면에 표시할 수 있는 프로젝트의 수는 "무제한"입니다. (디자인도 적용 되어 있습니다.) 3개로 제한하실려면 직접 3개만 제한하셔야 합니다.
 */
export const projects: {
  [key: string]: Project;
} = {
  "quack-quack": {
    name: "quack-quack",
    backgroundImage: Project1Img,
    description:
      "덕키의 디자인 시스템과 덕키팀에서 사용하는 코드규칙을 코드 린트로 제공하는 라이브러리 입니다. 꽥꽥은 대부분의 컴포넌트를 Hug Content 로 설계하여 다양한 화면 밀도에도 뭉개짐 없이 작동하도록..",
    iconImage: Project1Img,
    tags: ["Design System", "Code Style", "UX Writing"],
    target: [targets.android, targets.jetpackCompose, targets.react],
    link: "https://github.com/duckie-team/quack-quack",
    showFeaturedProjects: true,
  },
  "composable-function-reference-error-suppressor": {
    name: "composable-function-reference-error-suppressor",
    backgroundImage: Project2Img,
    description:
      "Composable 함수를 레퍼런스 참조하게 되면 발생하는 `COMPOSABLE_FUNCTION_REFERENCE` 에러를 억제시키는코틀린 컴파일러 플러그인 입니다. Composable 함수에 리플렉션이 필요할 때 사용할 수 있습니다.",
    iconImage: Project1Img,
    tags: ["Plugin"],
    target: [targets.jetpackCompose, targets.kotlin],
    link: "https://github.com/duckie-team/composable-function-reference-diagnostic-suppressor",
    showFeaturedProjects: true,
  },
  "duckie-opensource": {
    name: "duckie-opensource",
    backgroundImage: Project3Img,
    description:
      "덕키의 여러 오픈소스와 개발자 소식들을 웹으로 만나볼 수 있습니다.",
    iconImage: Project1Img,
    tags: ["Web"],
    target: [targets.react],
    link: "https://github.com/duckie-team/duckie-opensource",
    showFeaturedProjects: true,
  },
};
